# SomeObjectsNotExploded Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ImportFailures..::..SomeObjectsNotExploded Property
BuiltInFailures..::..ImportFailures Class See Also
---
Import contained some 3D data or points which can't be exploded.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SomeObjectsNotExploded { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SomeObjectsNotExploded As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SomeObjectsNotExploded {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ImportFailures Class
Autodesk.Revit.DB Namespace